rferland/BirdWatch/mangoire_esp32/app_httpd.cpp
#include <Arduino.h>
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "sdkconfig.h"
#include "camera_index.h"

#include "board_config.h"
#include "config_utils.h"
#include <ArduinoJson.h>

// Page HTML de configuration WiFi
static const char config_html[] = R"rawliteral(
<!DOCTYPE html>
<html lang='fr'>
<head>
  <meta charset='UTF-8'>
  <title>Configuration WiFi</title>
  <meta name='viewport' content='width=device-width,initial-scale=1'>
  <style>body{font-family:sans-serif;max-width:400px;margin:2em auto;}input,button{font-size:1em;margin:0.5em 0;width:100%;}</style>
</head>
<body>
  <h2>Configurer le WiFi</h2>
  <form id='wifiForm'>
    <label>SSID:<input name='ssid' required></label><br>
    <label>Mot de passe:<input name='password' type='password'></label><br>
    <button type='submit'>Enregistrer</button>
  </form>
  <button id='rebootBtn' style='background:#c00;color:#fff;'>Redémarrer l\'ESP32</button>
  <div id='msg'></div>
  <script>
    const form = document.getElementById('wifiForm');
    form.onsubmit = async e => {
      e.preventDefault();
      const data = {ssid:form.ssid.value,password:form.password.value};
      const res = await fetch('/api/config', {
        method:'POST',
        headers:{'Content-Type':'application/json'},
        body: JSON.stringify(data)
      });
      if(res.ok){
        document.getElementById('msg').innerHTML = 'Configuration enregistrée. Redémarrez l\'ESP32.';
      }else{
        document.getElementById('msg').innerHTML = 'Erreur lors de l\'enregistrement.';
      }
    };
    document.getElementById('rebootBtn').onclick = async () => {
      if(confirm('Redémarrer l\\'ESP32 ?')){
        const res = await fetch('/api/reboot', {method:'POST'});
        if(res.ok){
          document.getElementById('msg').innerHTML = 'Redémarrage en cours...';
        }else{
          document.getElementById('msg').innerHTML = 'Erreur lors du redémarrage.';
        }
      }
    };
  </script>
// Handler POST /api/reboot
static esp_err_t reboot_handler(httpd_req_t *req) {
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_sendstr(req, "{\"status\":\"rebooting\"}");
  delay(200);
  ESP.restart();
  return ESP_OK;
}
</body>
</html>
  )rawliteral";

// Handler GET /config.html
static esp_err_t config_html_handler(httpd_req_t *req)
{
  httpd_resp_set_type(req, "text/html");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_send(req, config_html, strlen(config_html));
  return ESP_OK;
}
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
// Handler pour POST /api/config
static esp_err_t config_update_handler(httpd_req_t *req)
{
  // Limite de 1024 octets pour la config
  char buf[1025];
  int total_len = req->content_len;
  if (total_len > 1024)
  {
    httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Payload trop gros");
    return ESP_FAIL;
  }
  int ret = httpd_req_recv(req, buf, total_len);
  if (ret <= 0)
  {
    httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "Lecture échouée");
    return ESP_FAIL;
  }
  buf[ret] = 0;

  StaticJsonDocument<1024> doc;
  DeserializationError error = deserializeJson(doc, buf);
  if (error)
  {
    httpd_resp_send_err(req, HTTPD_400_BAD_REQUEST, "JSON invalide");
    return ESP_FAIL;
  }
  if (!saveConfig(doc))
  {
    httpd_resp_send_err(req, HTTPD_500_INTERNAL_SERVER_ERROR, "Ecriture de la config échouée");
    return ESP_FAIL;
  }
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_sendstr(req, "{\"status\":\"ok\"}");
  return ESP_OK;
}
// Enregistrement du endpoint config
httpd_uri_t config_uri = {
    .uri = "/api/config",
    .method = HTTP_POST,
    .handler = config_update_handler,
    .user_ctx = NULL
#ifdef CONFIG_HTTPD_WS_SUPPORT
    ,
    .is_websocket = false,
    .handle_ws_control_frames = false,
    .supported_subprotocol = NULL
#endif
};

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;

#endif

typedef struct
{
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

typedef struct
{
  size_t size;  // number of values used for filtering
  size_t index; // current value index
  size_t count; // value count
  int sum;
  int *values; // array to be filled with values
} ra_filter_t;

static ra_filter_t ra_filter;

static ra_filter_t *ra_filter_init(ra_filter_t *filter, size_t sample_size)
{
  memset(filter, 0, sizeof(ra_filter_t));

  filter->values = (int *)malloc(sample_size * sizeof(int));
  if (!filter->values)
  {
    return NULL;
  }
  memset(filter->values, 0, sample_size * sizeof(int));

  filter->size = sample_size;
  return filter;
}

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
static int ra_filter_run(ra_filter_t *filter, int value)
{
  if (!filter->values)
  {
    return value;
  }
  filter->sum -= filter->values[filter->index];
  filter->values[filter->index] = value;
  filter->sum += filter->values[filter->index];
  filter->index++;
  filter->index = filter->index % filter->size;
  if (filter->count < filter->size)
  {
    filter->count++;
  }
  return filter->sum / filter->count;
}
#endif

#if defined(LED_GPIO_NUM)
void enable_led(bool en)
{ // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY))
  {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  ledcWrite(LED_GPIO_NUM, duty);
  // ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
  // ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
}
#endif

static esp_err_t bmp_handler(httpd_req_t *req)
{
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_start = esp_timer_get_time();
#endif
  fb = esp_camera_fb_get();
  if (!fb)
  {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/x-windows-bmp");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

